app/controllers/products_controller.rb

  def index
    # to show products which belong only to user
    @products = Product.where(user_id: current_user.id)
---
SELECT `products`.* FROM `products` WHERE `products`.`user_id` = 1

  def create
    @product = Product.new(product_params)
    # to tell product that it was created by user logged in
    @product.user = current_user

    respond_to do |format|
      if @product.save
---
INSERT INTO `products` (`name`, `description`, `deadline`, `contact`, `created_at`, `updated_at`, `user_id`) VALUES ('hello', '', '2020-03-31 23:35:00', '', '2020-03-31 23:36:03', '2020-03-31 23:36:03', 1)

  def update
    respond_to do |format|
      if @product.update(product_params)
---
UPDATE `products` SET `updated_at` = '2020-03-31 23:36:03' WHERE `products`.`id` = 1